// Напишите программу, которая вводит число, 
// умножает его на себя и выдает ответ.
Console.Write("Введите число: ");
int a = int.Parse(Console.ReadLine());

Console.WriteLine($" {a} x {a} = {a*a}");

